#+TITLE: C++ Notes

** Variable Scope
   A variable is visiable immediately after its declaration:
   #+begin_src C :results output
     #include <stdio.h>
     int a = 1;
     int b = 10;
     int main(int argc, char *argv[])
     {
         printf("%d\n", a);
         int a = 2;
         printf("%d\n", a);

         int b = b; /* b remains undefined */
         printf("%d\n", b);
         return 0;
     }

   #+end_src

   #+RESULTS:
   : 1
   : 2
   : 0

** Parameter Order
   Note that the evaluation order of the parameters of C/C++ is from
   right to left:
   #+begin_src C :results output
     #include <stdio.h>

     int func1() {printf("Function 1\n"); return 1;}
     int func2() {printf("Function 2\n"); return 1;}

     void func3(int a, int b) {return;}

     int main(int argc, char *argv[])
     {
         int b = 3;
         int arr[] = {6,7,8,9,10};
         int *ptr = arr;
         printf("%d, %d\n", *ptr, *(++ptr));

         printf("%d, %d\n", func1(), func2());

         func3(func1(), func2());
         return 0;
     }

   #+end_src

   #+RESULTS:
   : 7, 7
   : Function 2
   : Function 1
   : 1, 1
   : Function 2
   : Function 1

** sizeof
   1. Empty class have size of *1 byte*.
   2. If a class includes virtual function, or it uses virtual inherit
      it will add a pointer to a virtual table, thus need one more
      pointer.
   3. =static= member do not count when calculating =sizeof=.
   4. Other members are counted like =struct= for data alignment.
   5. Derived class will have all members of its parents.

   #+begin_src cpp :results output
     #include <iostream>
     using namespace std;

     class Empty {};
     class Derived1: public Empty {};
     class Derived2: public Empty {};
     class Multiple: public Derived1, public Derived2 {};

     class A: virtual public Empty {};
     class C: public A, public Derived1 {};

     class Virtual {virtual void display() {}};

     class Static{
         int a;
         static int not_count;
     };

     class Normal{
         int i;
         char c;
         double d;
         char cc;
     };


     int main(int argc, char *argv[])
     {
         cout << "In 64bit System" << endl;
         cout << "sizeof(Empty class):\t" << sizeof(Empty) << endl;
         cout << "sizeof(Derived class):\t" << sizeof(Derived1) << endl;
         cout << "sizeof(Multiple):\t" << sizeof(Multiple) << endl;
         cout << "sizeof(Multiple of virtual):\t" << sizeof(C) << endl;
         cout << "sizeof(virtual):\t" << sizeof(Virtual) << endl;
         cout << "sizeof(Static):\t" << sizeof(Static) << endl;
         cout << "sizeof(Normal):\t" << sizeof(Normal) << endl;
         cout << "sizeof(virtual inherit):\t" << sizeof(A) << endl;
         return 0;
     }
   #+end_src

   #+RESULTS:
   : In 64bit System
   : sizeof(Empty class):	1
   : sizeof(Derived class):	1
   : sizeof(Multiple):	2
   : sizeof(Multiple of virtual):	16
   : sizeof(virtual):	8
   : sizeof(Static):	4
   : sizeof(Normal):	24
   : sizeof(virtual inherit):	8

   A brief summary of struct alignment.
   1. Members are aligned to the next multiplications of their size. For
      example, =short= must be aligned to =addr%2 == 0=, =double=
      should be aligned to =addr%2 == 8=, etc.
   2. The size of struct is the multiple of the maximal size of its member.
   3. If a struct contains another struct, the final size of the
      struct is the multiple of the maximal size of all members of the
      struct recursively.
   #+begin_src C :results output
     /* in Linux 64-bit machine, sizeof(long double) = 16 */
     #include <stdio.h>
     struct NonEmpty {char c; long double d; char f;};
     struct Sub {
         struct NonEmpty a;
         char b;
     };

     int main(int argc, char *argv[])
     {
         printf("%d\n", sizeof(struct NonEmpty));
         printf("%d\n", sizeof(struct Sub));
         return 0;
     }
   #+end_src

   #+RESULTS:
   : 48
   : 64

   *Reference for structure padding*
   - [[http://www.catb.org/esr/structure-packing/][Structure Padding]]
   - [[http://www.geeksforgeeks.org/structure-member-alignment-padding-and-data-packing/][Structure Member Alignment]]

** Virtual Function
   Virtual function come into place where member function overriding
   exists. Normally, C++ will call the member function according to
   the type of current object.
   #+begin_src cpp :results output
     #include <iostream>
     using namespace std;

     class B
     {
     public:
         void display()
             { cout << "Content of base class.\n"; }
     };

     class D : public B
     {
     public:
         void display()
             {cout << "Content of derived class.\n"; }
     };

     int main(int argc, char *argv[])
     {
         B *b;
         D d;
         d.display();

         b = &d; /* convert pointer to derived object to base class */
         b->display();
         return 0;
     }
   #+end_src

   #+RESULTS:
   : Content of derived class.
   : Content of base class.

   Even if the object =b= points to is actually a object of class =D=,
   class =B='s member function =display= is called(member function of
   the class that matches the type of pointer).

   Virtual function gives the programmer the capability to call member
   function of different class by a same function call depending upon
   different context.

   #+begin_src cpp :results output
     #include <iostream>
     using namespace std;

     class B
     {
     public:
         virtual void display()
             { cout << "Content of base class.\n"; }
     };

     class D1 : public B
     {
     public:
         void display()
             {cout << "Content of first derived class.\n"; }
     };

     class D2 : public B
     {
     public:
         void display()
             {cout << "Content of second derived class.\n"; }
     };

     int main(int argc, char *argv[])
     {
         B *b;
         B bt;
         D1 d1;
         D2 d2;

         b = &bt;
         b->display(); /* calls B's display() */

         b = &d1;
         b->display(); /* calls display() of derived class D1 */

         b = &d2;
         b->display(); /* calls display() of derived class D2 */
         return 0;
     }
   #+end_src

   #+RESULTS:
   : Content of base class.
   : Content of first derived class.
   : Content of second derived class.

   In this example, =display()= function of the three classes are
   called with the same code.

   *pure virtual function* is declared using =virtual float area() =
   0=, Notice the =\=0= part.
   If a class contains at least one pure virtual function, that class
   is known as *abstract class* and cannot be instanciate.

   *References*
   - [[http://www.programiz.com/cpp-programming/virtual-functions][C++ Virtual Function]]

